Revit 2024 API
PlumbingUtils Class
 General utility methods in the Autodesk Revit MEP product.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static class PlumbingUtils
Visual Basic
Public NotInheritable Class PlumbingUtils
Visual C++
public ref class PlumbingUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Plumbing.PlumbingUtils
See Also
PlumbingUtils Members
Autodesk.Revit.DB.Plumbing Namespace